app/Controllers/Backend/Dashboard.php

    public function index()
    {
        // check jika user belum login
        if (is_null(session()->get('logged_in')) || empty(session()->get('logged_in')) || is_null(session()->get('username')) || empty(session()->get('username'))) {
            // maka redirect ke halaman login
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signin'));
        }

        // check admin account
        $checkAdminAccount = $this->admin->where('username', session()->get('username'))->where('status', 2)->first();
        // jika admin account tersuspend
        if (isset($checkAdminAccount)) {
            // maka redirect ke halaman logout
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signout'));
        }

        // check profile data account
        $checkProfileAccount = $this->profile_account->where('username', session()->get('username'))->first();
---
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
AND `status` = 2
 LIMIT 1
SELECT *
FROM `tbl_profile_account`
WHERE `username` = 'admin123'
 LIMIT 1

    public function table_visitors()
    {
        // check jika user belum login
        if (is_null(session()->get('logged_in')) || empty(session()->get('logged_in')) || is_null(session()->get('username')) || empty(session()->get('username'))) {
            // maka redirect ke halaman login
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signin'));
        }

        // check admin account
        $checkAdminAccount = $this->admin->where('username', session()->get('username'))->where('status', 2)->first();
        // jika admin account tersuspend
        if (isset($checkAdminAccount)) {
            // maka redirect ke halaman logout
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signout'));
        }

        // check profile data account
        $checkProfileAccount = $this->profile_account->where('username', session()->get('username'))->first();
---
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
AND `status` = 2
 LIMIT 1
SELECT *
FROM `tbl_profile_account`
WHERE `username` = 'admin123'
 LIMIT 1

            $searchValue        = $dtpostData['search']['value']; // Search value

            // Total number of records without filtering
            $totalRecords = $this->visitors->select('visitor_id')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_visitors`