app/Controllers/Backend/MyHistory.php

    public function index()
    {
        // check jika user belum login
        if (is_null(session()->get('logged_in')) || empty(session()->get('logged_in')) || is_null(session()->get('username')) || empty(session()->get('username'))) {
            // maka redirect ke halaman login
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signin'));
        }

        $checkAdminAccount = $this->admin->where('username', session()->get('username'))->where('status', 2)->first();
        // jika admin account tersuspend
        if (isset($checkAdminAccount)) {
            // maka redirect ke halaman logout
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signout'));
        }

        // require data
        $data['website_title']          = lang('Pages.my_history.title');
        $data['getDataAdminSession']    = $this->admin->where('username', session()->get('username'))->first();

        $data['getListAction']          = $this->log->select('action')->where('username', session()->get('username'))->distinct()->findAll();
        $data['getCountAll']            = $this->log->select('id')->where('username', session()->get('username'))->countAllResults();
        $data['getCountToday']          = $this->log->select('id')->where('username', session()->get('username'))->where('date_time >=', date('Y-m-d'))->countAllResults();
        $data['getCountYesterday']      = $this->log->select('id')->where('username', session()->get('username'))->where('date_time >=', date('Y-m-d', strtotime("-1 days")))->where('date_time <', date('Y-m-d'))->countAllResults();
        $data['getCountThisWeek']       = $this->log->select('id')->where('username', session()->get('username'))->where('date_time >=', date('Y-m-d', strtotime("-7 days")))->countAllResults();
        $data['getCountThisMonth']      = $this->log->select('id')->where('username', session()->get('username'))->where('date_time >=', date('Y-m'))->countAllResults();
---
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
AND `status` = 2
 LIMIT 1
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
 LIMIT 1
SELECT DISTINCT `action`
FROM `tbl_logs`
WHERE `username` = 'admin123'
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'
AND `date_time` >= '2023-12-28'
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'
AND `date_time` >= '2023-12-27'
AND `date_time` < '2023-12-28'
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'
AND `date_time` >= '2023-12-21'
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'
AND `date_time` >= '2023-12'

    public function table()
    {
        // check jika user belum login
        if (is_null(session()->get('logged_in')) || empty(session()->get('logged_in')) || is_null(session()->get('username')) || empty(session()->get('username'))) {
            // maka redirect ke halaman login
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signin'));
        }

        $checkAdminAccount = $this->admin->where('username', session()->get('username'))->where('status', 2)->first();
---
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
AND `status` = 2
 LIMIT 1

            $searchByDate       = $dtpostData['searchByDate'];

            // Total number of records without filtering
            $totalRecords = $this->log->select('id')->where('username', session()->get('username'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_logs`
WHERE `username` = 'admin123'