app/Controllers/Backend/MyProfile.php

SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
AND `status` = 2
 LIMIT 1
SELECT *
FROM `tbl_profile_account`
WHERE `username` = 'admin123'
 LIMIT 1
SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
 LIMIT 1
---
    public function index()
    {
        // check jika user belum login
        if (is_null(session()->get('logged_in')) || empty(session()->get('logged_in')) || is_null(session()->get('username')) || empty(session()->get('username'))) {
            // maka redirect ke halaman login
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signin'));
        }

        // check admin account
        $checkAdminAccount = $this->admin->where('username', session()->get('username'))->where('status', 2)->first();
        // jika admin account tersuspend
        if (isset($checkAdminAccount)) {
            // maka redirect ke halaman logout
            return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/signout'));
        }

        // check profile data account
        $checkProfileAccount = $this->profile_account->where('username', session()->get('username'))->first();
        // jika user / admin belum memberikan data profile
        //if (is_null($checkProfileAccount) || empty($checkProfileAccount)) {
        // maka redirect ke halaman setting account terlebih dahulu
        //    return redirect()->to(base_url('/' . $this->request->getLocale() . '/admin/account-settings'));
        //}

        // require data
        $data['WebsiteTitle']   = lang('Pages.my_profile.title');
        $data['DataAccount']    = $this->admin->where('username', session()->get('username'))->first();
        $data['DataProfile']    = $this->profile_account->where('username', session()->get('username'))->first();