app/Controllers/Backend/Signin.php

SELECT *
FROM `tbl_admins`
WHERE `username` = 'admin123'
OR `email` = 'admin123'
 LIMIT 1
---
                $remember_me = $this->request->getVar('remember_me', FILTER_SANITIZE_FULL_SPECIAL_CHARS);

                // get account for model
                $getAccount = $this->admin->where('username', $username)->orWhere('email', $username)->first();

UPDATE `tbl_admins` SET `is_login` = 1, `last_login_ip` = '::1', `last_login_time` = '2023-12-27 21:36:22'
WHERE `username` = 'admin123'
---
                                    'last_login_ip'     => $this->request->getIPAddress(),
                                    'last_login_time'   => date('Y-m-d H:i:s')
                                ];
                                $execUpdateAdminData = $this->admin->set($adminData)->where('username', $getAccount['username'])->update();

INSERT INTO `tbl_logs` (`username`, `action`, `description`, `url`, `level`, `ip_address`, `user_agent`) VALUES ('admin123', 'LOGIN', 'Have successfully sign in', 'http://localhost/ci4/public/en/admin/signin', '3', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36')
---
                                        'ip_address'    => $this->request->getIPAddress(),
                                        'user_agent'    => $this->request->getUserAgent()
                                    ];
                                    $insertingLogData = $this->log->insert($logData);