app/Models/WebsiteConfigurationModel.php

    public function getValue($name = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('value');
        $builder->where('name', array($name));
        $query = $builder->get();
---
SELECT `value`
FROM `tbl_website_configuration`
WHERE `name` = ('website_name')